In [2]:

# # Pandas 30秒快速練習題
# 這些練習題設計用於快速驗證 Pandas 的核心概念理解，每題應該能在 30 秒內想出解法。

import pandas as pd
import numpy as np

# 設定顯示選項
pd.set_option('display.max_columns', None)
pd.set_option('display.expand_frame_repr', False)


## M2.1: DataFrame 與 Series 基礎

In [4]:
# 練習 1.1: Series 建立
# 任務：建立一個包含 5 個城市及其人口數的 Series，並設定適當的索引
# 提示：使用 pd.Series() 並指定 index
city_data = {
    '臺北市': 2594581,
    '新北市': 4022137,
    '桃園市': 2276532,
    '臺中市': 2843779,
    '高雄市': 2733979
}
population = pd.Series( city_data,name='population')
population

臺北市    2594581
新北市    4022137
桃園市    2276532
臺中市    2843779
高雄市    2733979
Name: population, dtype: int64

In [12]:
# 練習 1.2: DataFrame 建立
# 任務：建立一個包含學生資訊的 DataFrame，包含姓名、年齡、成績三個欄位，至少 3 筆資料
# 提示：使用 pd.DataFrame() 從字典建立
student_info = {
    '姓名': ['王小明', '李靜宜', '陳大華', '林美玲'],
    '年齡': [18, 19, 18, 20],
    '成績': [85.5, 92.0, 78.5, 95.0]
}
students_df = pd.DataFrame(student_info)
students_df

    姓名  年齡    成績
0  王小明  18  85.5
1  李靜宜  19  92.0
2  陳大華  18  78.5
3  林美玲  20  95.0

In [6]:
# 練習 1.3: DataFrame 基本資訊
# 任務：檢查 students_df 的基本資訊（資料型態、非空值數量等）
# 提示：使用 .info() 方法
# 在此處檢查資訊
students_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   姓名      4 non-null      object
 1   年齡      4 non-null      int64
 2   成績      4 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 228.0+ bytes


## M2.2: 檔案讀取與寫入

In [2]:
print("當前工作目錄 (CWD):", os.getcwd())

當前工作目錄 (CWD): C:\Users\User\work station\iSpan_python-DA-cookbooks\Special-Edition_python_DA\Python_DA_Course\M2_Pandas_Basic

In [4]:
# 練習 2.1: CSV 讀取
# 任務：讀取 'air-quality.csv' 檔案
# 提示：使用 pd.read_csv()
import numpy as np
import pandas as pd
import os

# 設置顯示選項
pd.set_option('display.max_rows', 10)
pd.set_option('display.max_columns', 10)
pd.set_option('display.width', 80)
pd.set_option('display.precision', 3)

# 設置數據文件路徑
data_dir = os.path.join( 'data')

air_quality_file = os.path.join(data_dir, 'air-quality.csv')
df_csv = pd.read_csv(air_quality_file)
df_csv

           Date  Ozone  Solar  Wind  Temp
0    1976-05-01   41.0  190.0   7.4    67
1    1976-05-02   36.0  118.0   8.0    72
2    1976-05-03   12.0  149.0  12.6    74
3    1976-05-04   18.0  313.0  11.5    62
4    1976-05-05    NaN    NaN  14.3    56
..          ...    ...    ...   ...   ...
148  1976-09-26   30.0  193.0   6.9    70
149  1976-09-27    NaN  145.0  13.2    77
150  1976-09-28   14.0  191.0  14.3    75
151  1976-09-29   18.0  131.0   8.0    76
152  1976-09-30   20.0  223.0  11.5    68

[153 rows x 5 columns]

In [10]:
# 練習 2.2: Excel 讀取
# 任務：讀取 '通訊錄_output.xlsx' 檔案
# 提示：使用 pd.read_excel()
import openpyxl
print("當前工作目錄 (CWD):", os.getcwd())
data_dir = os.path.join( 'exercises_HW')

products_file = os.path.join(data_dir, 'products_data.xlsx')
df_excel = pd.read_excel(products_file)
df_excel

當前工作目錄 (CWD): C:\Users\User\work station\iSpan_python-DA-cookbooks\Special-Edition_python_DA\Python_DA_Course\M2_Pandas_Basic

    ID       Name   Price  Stock
0  101  Product A   99.99    100
1  102  Product B  149.99     75
2  103  Product C  199.99     50

In [ ]:
# 練習 2.3: 資料匯出
# 任務：將 air-quality.csv 儲存為 CSV 檔案，名稱為 'output_students.csv'
# 提示：使用 .to_csv() 方法
# 在此處匯出資料


# ## M2.3: 資料選取方法

In [15]:
# 練習 3.1: 欄位選取
# 任務：從 students_df 中選取 '姓名' 和 '成績' 欄位
# 提示：使用中括號 [] 或 .loc
selected_columns = students_df[['姓名','成績']]
selected_columns

    姓名    成績
0  王小明  85.5
1  李靜宜  92.0
2  陳大華  78.5
3  林美玲  95.0

In [16]:
# 練習 3.2: 條件篩選
# 任務：找出 students_df 中成績大於 80 的學生
# 提示：使用布林索引
high_scores = students_df[students_df['成績']> 80]
high_scores

    姓名  年齡    成績
0  王小明  18  85.5
1  李靜宜  19  92.0
3  林美玲  20  95.0

In [20]:
# 練習 3.3: iloc 使用
# 任務：選取 students_df 的前兩列和第一、第三欄
# 提示：使用 .iloc

selected_data = students_df.iloc[0:2,[0,2]]
selected_data

    姓名    成績
0  王小明  85.5
1  李靜宜  92.0


## M2.4: 缺失值處理

In [21]:
# 建立包含缺失值的測試資料
test_df = pd.DataFrame({
    'A': [1, np.nan, 3, np.nan, 5],
    'B': [np.nan, 2, 3, 4, 5],
    'C': [1, 2, np.nan, 4, 5]
})

In [23]:
# 練習 4.1: 缺失值檢查
# 任務：檢查每個欄位的缺失值數量
# 提示：使用 .isnull() 和 .sum()
missing_count = test_df.isnull().sum()
missing_count

A    2
B    1
C    1
dtype: int64

In [25]:
# 練習 4.2: 填補缺失值
# 任務：將 test_df 中的缺失值以該欄位的平均值填補
# 提示：使用 .fillna() 和 .mean()
filled_df = test_df.fillna(test_df.mean())
filled_df

     A    B    C
0  1.0  3.5  1.0
1  3.0  2.0  2.0
2  3.0  3.0  3.0
3  3.0  4.0  4.0
4  5.0  5.0  5.0

In [31]:
# 練習 4.3: 刪除缺失值
# 任務：刪除 test_df 中含有缺失值的列
# 提示：使用 .dropna()
cleaned_df = test_df.dropna()
cleaned_df
students_df

    姓名  年齡    成績
0  王小明  18  85.5
1  李靜宜  19  92.0
2  陳大華  18  78.5
3  林美玲  20  95.0


## M2.5: 資料轉換

In [28]:
# 建立測試資料
dates_df = pd.DataFrame({
    'date_str': ['2024-01-01', '2024-01-02', '2024-01-03'],
    'value': [100, 200, 300]
})

In [30]:
# 練習 5.1: 資料型態轉換
# 任務：將 'date_str' 欄位轉換為日期型態
# 提示：使用 pd.to_datetime()
dates_df['date'] = pd.to_datetime(dates_df['date_str'])
dates_df

     date_str  value       date
0  2024-01-01    100 2024-01-01
1  2024-01-02    200 2024-01-02
2  2024-01-03    300 2024-01-03

In [34]:
# 練習 5.2: 數值轉換
# 任務：將 students_df 中的成績轉換為等第（90以上為A，80-89為B，70-79為C，60-69為D，低於60為F）
# 提示：使用 .apply() 或 pd.cut()
bins = [0,60,70,80,90,100]
labels = ['F','D','C','B','A']
students_df['grades'] = pd.cut(x=students_df["成績"],bins=bins,labels=labels,right=False,include_lowest=True)
students_df

    姓名  年齡    成績 grades
0  王小明  18  85.5      B
1  李靜宜  19  92.0      A
2  陳大華  18  78.5      C
3  林美玲  20  95.0      A

In [35]:
# 練習 5.3: 資料重塑
# 任務：將以下資料從長格式轉換為寬格式
long_df = pd.DataFrame({
    'student': ['A', 'A', 'B', 'B'],
    'subject': ['Math', 'English', 'Math', 'English'],
    'score': [85, 90, 75, 85]
})
# 提示：使用 .pivot() 或 .pivot_table()
wide_df = long_df.pivot(index="student",columns="subject",values="score")
wide_df

subject  English  Math
student
A             90    85
B             85    75